app/controllers/kittens_controller.rb

	def index
		@kittens = Kitten.all
---
SELECT "kittens".* FROM "kittens"

	def create
		@kitten = Kitten.new(kitten_params)
		if @kitten.save
---
INSERT INTO "kittens" ("name", "age", "cuteness", "softness", "toughness", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

	def edit
		@kitten = Kitten.find(params[:id])
---
SELECT  "kittens".* FROM "kittens" WHERE "kittens"."id" = ? LIMIT 1  [["id", 1]]

	def show
		@kitten = Kitten.find(params[:id])
---
SELECT  "kittens".* FROM "kittens" WHERE "kittens"."id" = ? LIMIT 1  [["id", 1]]